# Початковий список завдань
print("Привіт ось ваш список фільмів які б ви хотіли переглянути")
todo_list = ["Дюна 2", "Червоне повідомлення", "Підземелля драконів:честь злодіїв","Піаніст" ]
# Виведення початкового списку
print(todo_list)

# Запит на додавання завдання
answer1 = input('Чи бажаєте ви додати якийсь фільм ? (так/ні): ').lower()
if answer1 == "так":
    new_task = input("Введіть те, що хочете додати:\n")
    todo_list.append(new_task)
else:
    print('Окей')

# Запит на видалення завдання
answer2 = input('Чи бажаєте ви видалити якийсь з фільмів? (так/ні): ').lower()
if answer2 == "так":
    try:
        task_index = int(input("Введіть індекс того, що хочете видалити (починаючи з 0):\n"))
        if 0 <= task_index < len(todo_list):
            removed_task = todo_list.pop(task_index)
            print(f'Фільм "{removed_task}" видалено зі списку.')
        else:
            print("Невірний індекс фільму.")
    except ValueError:
        print("Будь ласка, введіть коректний індекс.")
else:
    print('Окей')

# Запит на перегляд списку
answer3 = input('Чи бажаєте ви переглянути список фільмів? (так/ні): ').lower()
if answer3 == "так":
    print(todo_list)
else:
    print('Ну тоді все, дякую!')